"""
Создайте матрицу размером 3х3 и выведите значения с индексами 1,2 и 3,3
"""
matrix = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
print("Значения c индексами 1 и 2:", matrix[0][1])
print("Значения с индексами 3 и 4:", matrix[2][2])